In [1]:
import numpy as np
import pandas as pd

In [75]:
data_list=[
    [ "Alice", 28, 75000, "New York"],
    ["Bob", 34, 68000, "Los Angeles"],
    ["Carol", 25, 72000, "Chicago"],
    ["David", 40, 90000, "Houston"],
    ["Emma", 30, 81000, "San Francisco"]
]

In [76]:
labels=['a','b','c','d','e']

In [77]:
column=['name','age','salaries','city']

In [78]:
x=pd.DataFrame(data_list,columns=column,index=labels)

In [79]:
x

    name  age  salaries           city
a  Alice   28     75000       New York
b    Bob   34     68000    Los Angeles
c  Carol   25     72000        Chicago
d  David   40     90000        Houston
e   Emma   30     81000  San Francisco

In [80]:
x['designation']=['doctor','engg','prof','manager','engg']

In [81]:
x

    name  age  salaries           city designation
a  Alice   28     75000       New York      doctor
b    Bob   34     68000    Los Angeles        engg
c  Carol   25     72000        Chicago        prof
d  David   40     90000        Houston     manager
e   Emma   30     81000  San Francisco        engg

In [82]:
x.loc['a']

name              Alice
age                  28
salaries          75000
city           New York
designation      doctor
Name: a, dtype: object

In [83]:
x.loc[['b','d','e']] # here u getting row information by giving row name

    name  age  salaries           city designation
b    Bob   34     68000    Los Angeles        engg
d  David   40     90000        Houston     manager
e   Emma   30     81000  San Francisco        engg

In [84]:
x.iloc[2] # but here u have to give the row index number to take information of that row

name             Carol
age                 25
salaries         72000
city           Chicago
designation       prof
Name: c, dtype: object

## selecting subsets of rows and column

In [85]:
x.loc['a']['city']

'New York'

In [86]:
x.loc[['a','c']][['city','age']]

       city  age
a  New York   28
c   Chicago   25

In [87]:
x.loc[['c','d']][['name','age']]

    name  age
c  Carol   25
d  David   40

## conditional selection

In [88]:
#want to see those people whose age is above 30

In [89]:
x['age']>30

a    False
b     True
c    False
d     True
e    False
Name: age, dtype: bool

In [90]:
x[x['age']>30]

    name  age  salaries         city designation
b    Bob   34     68000  Los Angeles        engg
d  David   40     90000      Houston     manager

In [97]:
# tell me the people whose age is above 30 and from Houston

In [98]:
x[(x['age']>30) & (x['city']=='Houston')]

    name  age  salaries     city designation
d  David   40     90000  Houston     manager